//大一生寫出Hello World:

#include <cstdio>

#define 朋友們好啊 int
#define 我是混元形意太極門掌門人馬保國 main
#define 剛才有個朋友問我馬老師發生甚麼事了 (
#define 我說怎麼回事給我發了幾張截圖 void
#define 我一看原來是昨天有兩個年輕人 )
#define 三十多歲，一個體重九十多公斤，一個體重八十多公斤 {
#define 他們說有一個說我在健身房練功頸椎練壞了 putchar
#define 馬老師你能不能教教我混元功法 (
#define 幫助我治療一下我的頸椎病 'h'
#define 一我說可以 )
#define 我說你在健身房練死勁 ;
#define 不好用 putchar
#define 他不服氣 (
#define 我說小朋友 'e'
#define 你兩個手來折我一個手指頭 )
#define 他折不動 ;
#define 他說你這也沒用 putchar
#define 我說我這個有用，這是化勁 (
#define 傳統功夫講究化勁，四兩撥千斤 'l'
#define 二百多斤的英國大理石 )
#define 都撾不動我的一根手指頭  ;
#define 他非要和我試試 putchar
#define 我說可以 (
#define 我一說完他啪的一下就站起來了 'l'
#define 很快啊 )
#define 然後上來就是一個左正蹬，一個右邊腿，一個左刺拳 ;
#define 我全部防出去了啊 putchar
#define 防出去以後自然是傳統功夫以點到為止 (
#define 右拳放到鼻子上沒打他 'o'
#define	我笑一下準備收拳 )
#define 因為這時間，按傳統功夫以點到為止，他已經輸了 ;
#define 如果這一拳發力，一拳就把他鼻子打骨折了 putchar
#define 放在鼻子上沒有打他 (
#define 他也承認，是我先打到他面部 'w'
#define 他不知道拳放在他鼻子上 )
#define 他承認我先打到他面部啊 ;
#define 我收拳不打了 putchar
#define 他突然襲擊 (
#define 左刺拳來打我臉 'o'
#define 我大E了啊 )
#define 沒有閃 ;
#define	他的左拳給我右眼蹭了一下 putchar
#define	但沒關係啊 (
#define 當時流眼淚了，捂著眼睛，我說婷婷 'r'
#define 然後兩分鐘以後就好了 )
#define 我說小伙子你不講武德 ;
#define 他說馬老師我不懂 putchar
#define 我不懂規矩 (
#define 他說他是亂打的 'l'
#define 他可不是亂打的啊 )
#define 正蹬邊腿左刺拳訓練有素 ;
#define 後來他說練過三四年泰拳 putchar
#define 看來是有bear來 (
#define 這兩個年輕人不講武德 'd'
#define 來騙，來偷襲我這個六十九歲的老同志 )
#define 這好嗎？這不好 ;
#define 我勸這兩位年輕人耗子尾汁好好反思 return
#define 以後不要再犯這樣的聰明  0
#define 武林要以和為貴 ;
#define 要講武德，不要搞窩裡鬥 }
#define 謝謝朋友們	//結束了

朋友們好啊 我是混元形意太極門掌門人馬保國
剛才有個朋友問我馬老師發生甚麼事了 我說怎麼回事給我發了幾張截圖 我一看原來是昨天有兩個年輕人 三十多歲，一個體重九十多公斤，一個體重八十多公斤
他們說有一個說我在健身房練功頸椎練壞了 馬老師你能不能教教我混元功法 幫助我治療一下我的頸椎病
一我說可以 我說你在健身房練死勁 不好用 他不服氣 我說小朋友 你兩個手來折我一個手指頭 他折不動
他說你這也沒用 我說我這個有用，這是化勁  傳統功夫講究化勁，四兩撥千斤 二百多斤的英國大理石 都撾不動我的一根手指頭 他非要和我試試 我說可以 
我一說完他啪的一下就站起來了 
很快啊 
然後上來就是一個左正蹬，一個右邊腿，一個左刺拳 我全部防出去了啊 
防出去以後自然是傳統功夫以點到為止 右拳放到鼻子上沒打他 
我笑一下準備收拳 因為這時間，按傳統功夫以點到為止，他已經輸了 如果這一拳發力，一拳就把他鼻子打骨折了 放在鼻子上沒有打他 他也承認，是我先打到他面部 
他不知道拳放在他鼻子上 他承認我先打到他面部啊 
我收拳不打了 他突然襲擊 左刺拳來打我臉 
我大E了啊
沒有閃 
他的左拳給我右眼蹭了一下 但沒關係啊 
當時流眼淚了，捂著眼睛，我說婷婷 然後兩分鐘以後就好了 
我說小伙子你不講武德 
他說馬老師我不懂 我不懂規矩 
他說他是亂打的 他可不是亂打的啊 
正蹬邊腿左刺拳訓練有素 後來他說練過三四年泰拳 
看來是有bear來 
這兩個年輕人不講武德 來騙，來偷襲我這個六十九歲的老同志 
這好嗎？這不好 
我勸這兩位年輕人耗子尾汁好好反思 
以後不要再犯這樣的聰明 
武林要以和為貴 要講武德，不要搞窩裡鬥
謝謝朋友們